[
    "* Monthly pricing is after purchase using credit card interest at 0% p.a. over a nine-month tenure. Monthly pricing is rounded to the nearest ringgit and displayed for each product added in the order. Exact pricing will be for the whole order and provided by your bank, subject to your bank’s terms and conditions.",
    "◊◊ Terms & Conditions of 0% interest for 6-,12- and 24-month instalment payment plans",
    "0% interest instalment payment plans are available to qualified Malaysia residents and provided by Affin, Ambank, CIMB, Hong Leong, Maybank, OCBC and RHB. To qualify for the 0% interest for 6-, 12- or 24-month instalment offers, your purchase minimum value must be MYR 2,000 or more in a single transaction. All purchases on 0% interest instalment plans are subject to approval by your credit card issuer. Refer to your credit card issuer’s website for conditions, fees and charges.",
    "Instalment offers are only available to individual customers using consumer credit cards. Apple Employee EPP orders, Education Store orders, business purchases and institutional purchases are not eligible for this offer. Only Visa and Mastercard credit cards are eligible for this offer. If your instalment order is not approved by your credit card issuer, we will not be informed of the reason. Please contact your credit card issuer for further information. Purchases will be billed to your account upon order placement. Offer is available on advertised or ticketed price.",
    "The information is current as of 23 April 2024.",
    "** Trade-in service is provided by Apple’s trade-in partners. Trade-in value quotes are estimated only and actual values may be lower than the estimation. Trade-in values vary based on the condition, year and model of your trade-in device. Not all devices are eligible for credit. You must be at least the age of majority to be eligible to trade in for credit. Trade-in value may be applied towards qualifying new device purchase. Actual value awarded is based on receipt of a qualifying device matching the description provided when the estimate was made. Apple’s trade-in partners reserve the right to refuse, cancel or limit quantity of any trade-in transaction for any reason. More details are available from Apple’s trade-in partner for trade-in and recycling of eligible devices. Restrictions and limitations may apply. For recycling eligible equipment Terms and restrictions may apply.",
    "1. 1GB = 1 billion bytes and 1TB = 1 trillion bytes; actual formatted capacity less.",
    "2. The displays on the 14-inch and 16-inch MacBook Pro have rounded corners at the top. When measured as a standard rectangular shape, the screens are 14.2 inches and 16.2 inches diagonally (actual viewable area is less).",
    "3. Testing conducted by Apple in September and October 2023 using pre-production 14-inch MacBook Pro systems with Apple M3 Pro,12-core CPU, 18-core GPU,36GB of RAM and 4TB SSD. Final Cut Pro 10.6.9 tested using a 1-minute picture-in-picture project with multiple streams of Apple ProRes 422 video at 8192x4320 resolution and 30 frames per second, as well as a 1-minute picture-in-picture project with multiple streams of Apple ProRes 422 video at 3840x2160 resolution and 29.97 frames per second. Performance tests are conducted using specific computer systems and reflect the approximate performance of MacBook Pro.",
    "4. Testing conducted by Apple in September and October 2023 using pre-production 14-inch MacBook Pro systems with Apple M3 Max,16-core CPU,40-core GPU, 128GB of RAM and 8TB SSD. Final Cut Pro 10.6.9 tested using a 1-minute picture-in-picture project with multiple streams of Apple ProRes 422 video at 8192x4320 resolution and 30 frames per second, as well as a 1-minute picture-in-picture project with multiple streams of Apple ProRes 422 video at 3840x2160 resolution and 29.97 frames per second. Performance tests are conducted using specific computer systems and reflect the approximate performance of MacBook Pro.",
    "5. Testing conducted by Apple in September and October 2023 using pre-production 16-inch MacBook Pro systems with Apple M3 Pro, 12-core CPU, 18-core GPU, 36GB of RAM and 512GB SSD, and pre-production 14-inch MacBook Pro systems with Apple M3 Pro, 12-core CPU, 18-core GPU, 18GB of RAM and 1TB SSD. 16-inch MacBook Pro systems tested with Apple 140W USB-C Power Adapter (Model A2452), and 14-inch MacBook Pro systems tested with Apple 96W USB-C Power Adapter (Model A2166), both with USB-C to MagSafe 3 Cable (Model A2363). Fast-charge testing conducted with drained MacBook Pro units. Charge time varies with settings and environmental factors; actual results will vary",
    "6. Testing conducted by Apple in September and October 2023 using pre-production 16-inch MacBook Pro systems with Apple M3 Pro, 12-core CPU, 18-core GPU, 36GB of RAM and 4TB SSD. Final Cut Pro 10.6.9 tested using a 1-minute picture-in-picture project with multiple streams of Apple ProRes 422 video at 8192x4320 resolution and 30 frames per second, as well as a 1-minute picture-in-picture project with multiple streams of Apple ProRes 422 video at 3840x2160 resolution and 29.97 frames per second. Performance tests are conducted using specific computer systems and reflect the approximate performance of MacBook Pro.",
    "7. Testing conducted by Apple in September and October 2023 using pre-production 16-inch MacBook Pro systems with Apple M3 Max, 16-core CPU, 40-core GPU, 128GB of RAM and 8TB SSD. Final Cut Pro 10.6.9 tested using a 1-minute picture-in-picture project with multiple streams of Apple ProRes 422 video at 8192x4320 resolution and 30 frames per second, as well as a 1-minute picture-in-picture project with multiple streams of Apple ProRes 422 video at 3840x2160 resolution and 29.97 frames per second. Performance tests are conducted using specific computer systems and reflect the approximate performance of MacBook Pro.",
    "*** Apple TV+ offer available to new and qualified returning subscribers only. RM 29.90/month after free trial. Only one offer per Apple ID and only one offer per family if you’re part of a Family Sharing group, regardless of the number of devices that you or your family purchase. This offer is not available if you or your Family have previously accepted an Apple TV+ three-months-free or one-year-free offer. Offer valid for three months after eligible device is activated. Plan automatically renews until cancelled. Restrictions and other terms apply.",
    "^ New subscribers only. RM 29.90/month after free trial. Plan automatically renews after trial until cancelled.",
    "We use your location to show you delivery options faster. We found your location using your IP address or because you entered it during a previous visit to Apple."
]